# 撰寫一程式，檔案名稱 ttt_game.py
# 由兩方交替輸入棋子位置，'x' 棋為先手，'o' 棋為後手，
# 每一輪開始時，提示使用者輸入下棋位置，並檢查可否落子，落子失敗則退出程式，
# 成功落子後顯示棋盤狀態，並判斷勝負，勝利則顯示該方勝利，否則繼續下一輪


# 棋盤格變數：保存棋盤狀態的變數
# 變數編號對應的棋盤位置如下
#  1 | 2 | 3 
# ---+---+---
#  4 | 5 | 6 
# ---+---+---
#  7 | 8 | 9 
cell_1 = ' '
cell_2 = ' '
cell_3 = ' '
cell_4 = ' '
cell_5 = ' '
cell_6 = ' '
cell_7 = ' '
cell_8 = ' '
cell_9 = ' '

# 顯示棋盤

# 第 1 輪
# 設定目前棋子 x 先
chess = 'x'
# 選擇位置
position = int(input('請輸入棋子位置：'))
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負
# TODO: 程式寫這裡

# 第 2 輪
# 設定目前棋子
chess = 'o'
# 選擇位置
# TODO: 程式寫這裡
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負
# TODO: 程式寫這裡

# 第 3 輪
# 設定目前棋子
# TODO: 程式寫這裡
# 選擇位置
# TODO: 程式寫這裡
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負
# TODO: 程式寫這裡

# 第 4 輪
# 設定目前棋子
# TODO: 程式寫這裡
# 選擇位置
# TODO: 程式寫這裡
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負
# TODO: 程式寫這裡

# 第 5 輪
# 設定目前棋子
# TODO: 程式寫這裡
# 選擇位置
# TODO: 程式寫這裡
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負
# TODO: 程式寫這裡

# 第 6 輪
# 設定目前棋子
# TODO: 程式寫這裡
# 選擇位置
# TODO: 程式寫這裡
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負
# TODO: 程式寫這裡

# 第 7 輪
# 設定目前棋子
# TODO: 程式寫這裡
# 選擇位置
# TODO: 程式寫這裡
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負
# TODO: 程式寫這裡

# 第 7 輪
# 設定目前棋子
# TODO: 程式寫這裡
# 選擇位置
# TODO: 程式寫這裡
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負
# TODO: 程式寫這裡

# 第 8 輪
# 設定目前棋子
# TODO: 程式寫這裡
# 選擇位置
# TODO: 程式寫這裡
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負
# TODO: 程式寫這裡

# 第 9 輪
# 設定目前棋子
# TODO: 程式寫這裡
# 選擇位置
# TODO: 程式寫這裡
# 檢查位置是否被佔用
# TODO: 程式寫這裡
# 更新棋盤變數
# TODO: 程式寫這裡
# 顯示棋盤
# TODO: 程式寫這裡
# 確認勝負(如果沒有勝利顯示平局)
# TODO: 程式寫這裡
